app/controllers/school_classes_controller.rb

  def index
    @klasses = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"