app/controllers/students_controller.rb

  def update
    student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Mejia"], ["updated_at", "2020-12-23 17:02:49.449542"], ["id", 5]]